josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto-lowpower.ino
// ── Identify button ("mírame") ─────────────────────────────────────────────
#define IDENTIFY_PIN          4     // GPIO4, pulsador N.O. a GND
#define IDENTIFY_DEBOUNCE_MS  50    // antirrebote

// ── Fase 39: anuncio de inventario de fábrica ───────────────────────────────
// El backend conserva el estado autoritativo; estos valores solo viven en RAM.
#define FACTORY_ANNOUNCE_RETRY_MS   30000UL
#define FACTORY_ANNOUNCE_TIMEOUT_MS 1000

// ── LOW-POWER / ANTI-BROWNOUT (solo software) ───────────────────────────────
// El pico de corriente dominante es el TX de WiFi a máxima potencia (~19.5 dBm).
// Bajarlo + escalonar cargas + no solapar el relé con TLS es la mejor defensa sin
// tocar hardware. WIFI_TX_POWER se usa en arranque normal; SAFE_TX_POWER si el
// arranque anterior terminó en BROWNOUT (auto-throttle).
#define WIFI_TX_POWER          WIFI_POWER_8_5dBm
#define SAFE_TX_POWER          WIFI_POWER_2dBm
#define BOOT_SETTLE_MS         4000          // quiet time con la radio apagada
#define USB_BOOT_DELAY_MS      500           // respiro antes de encender el host USB
#define USB_BOOT_DELAY_BROWNOUT_MS 6000      // extra si venimos de brownout
#define HTTP_GAP_MS            200           // separación entre peticiones TLS
#define WIFI_RETRY_MS          30000         // reintento de conexión (sin reinicio)

// v2 (bisect): los dos ajustes que se sospechan culpables del cuelgue/TASK_WDT
// quedan APAGADOS por defecto. Poner a 1 solo para probar en aislamiento.
//   LOWPOWER_CPU_80MHZ=1 → setCpuFrequencyMhz(80)  (puede romper timing WiFi/TLS)
//   LOWPOWER_WIFI_SLEEP=1 → WiFi.setSleep(true)    (modem-sleep puede colgar TLS)
// Con 0 se usa CPU por defecto y WiFi.setSleep(false) por estabilidad.
#define LOWPOWER_CPU_80MHZ     0
#define LOWPOWER_WIFI_SLEEP    0
#define CPU_FREQ_MHZ           80            // solo se aplica si LOWPOWER_CPU_80MHZ

// 1 = desactivar el brownout detector (ÚLTIMO RECURSO: riesgo de corrupción de
// NVS/flash si la rail cae). 0 = dejarlo activo (recomendado).
#define DISABLE_BROWNOUT       0

// ── Globales ──────────────────────────────────────────────────────────────
EspUsbHost usb;
String     scanned;
String     pendingQr;
bool       hasPending = false;
unsigned long lastBeat = 0;
bool       scannerConnected = false;  // F33: set true on USB connect, false on disconnect
// F33: el callback USB corre en la tarea del host USB. NUNCA debe usar el
// WiFiClientSecure/HTTPClient compartidos (panic por uso concurrente). El
// heartbeat de SCANNER se pide aquí y lo envía loop() de forma secuencial.
volatile bool scannerBeatPending = false;

// ── Fase 1: Non-blocking relay state ──
unsigned long relayOffAt = 0;
bool          relayPulsing = false;

// ── LOW-POWER: LOCK heartbeat diferido (no solapar TLS con el relé) ──
volatile bool lockHeartbeatPending = false;

// ── LOW-POWER: motivo del arranque (auto-throttle) ──
esp_reset_reason_t bootResetReason = ESP_RST_UNKNOWN;
bool               bootFromBrownout = false;
bool               bootFromWdt = false;   // v2: cuelgue SW (TASK_WDT/PANIC/WDT)
// Contador de reinicios en RTC (sobrevive reinicios; se limpia en power-on).
RTC_NOINIT_ATTR uint32_t rtcBootCount;

// ── Fase 1: Non-blocking LED + WiFi watchdog state ──
unsigned long ledOffAt = 0;
unsigned long wifiDownSince = 0;

// ── Fase 39: scheduler de anuncio integrado (efímero por arranque) ─────────
bool          factoryAnnouncementEnabled = true;
bool          factoryAnnouncementInFlight = false;
unsigned long factoryNextAttemptAt = 0;
String        deviceFactoryKey;

// ── LOW-POWER: helpers de arranque ─────────────────────────────────────────
const char* resetReasonName(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "POWERON";
    case ESP_RST_EXT:       return "EXT_RESET";
    case ESP_RST_SW:        return "SW_RESET";
    case ESP_RST_PANIC:     return "PANIC";
    case ESP_RST_INT_WDT:   return "INT_WDT";
    case ESP_RST_TASK_WDT:  return "TASK_WDT";
    case ESP_RST_WDT:       return "WDT";
    case ESP_RST_BROWNOUT:  return "BROWNOUT";
    case ESP_RST_DEEPSLEEP: return "DEEPSLEEP";
    case ESP_RST_SDIO:      return "SDIO";
    default:                return "UNKNOWN";
  }
}

// Radio de bajo consumo. Llamar SIEMPRE tras WiFi.mode() y antes de begin()/AP.
// Si el arranque anterior fue BROWNOUT, usa la potencia segura (2 dBm).
void configureRadio() {
  WiFi.setTxPower(bootFromBrownout ? SAFE_TX_POWER : WIFI_TX_POWER);
#if LOWPOWER_WIFI_SLEEP
  WiFi.setSleep(true);
#else
  WiFi.setSleep(false);  // v2: modem-sleep OFF → handshakes TLS estables
#endif
}

// v2: código de LED según el motivo del arranque anterior, para diagnóstico sin
// monitor serie (crítico cuando la placa va a la fuente).
//   1 = normal | 2 = cuelgue software (WDT/PANIC) | 3 = brownout (eléctrico)
int ledCodeForResetReason(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_BROWNOUT:  return 3;
    case ESP_RST_TASK_WDT:
    case ESP_RST_INT_WDT:
    case ESP_RST_WDT:
    case ESP_RST_PANIC:     return 2;
    default:                return 1;
  }
}

// Diagnóstico sin monitor serie: parpadea el LED incorporado N veces.
void ledBlinkDiagnostic(int times) {
  pinMode(LED_PIN, OUTPUT);
  for (int i = 0; i < times; i++) {
    digitalWrite(LED_PIN, HIGH);
    delay(250);
    digitalWrite(LED_PIN, LOW);
    delay(250);
  }
}

WiFiClientSecure &apiTlsClient() {
  static WiFiClientSecure client;
  static bool configured = false;
  if (!configured) {
    client.setCACert(CERRADURAS_API_CA_PEM);
    // v2: el handshake por defecto puede bloquear hasta ~120 s (>> TWDT) y
    // provocar el reinicio por watchdog. Se acota a 10 s para fallar/retentar.
    client.setHandshakeTimeout(10);
    configured = true;
  }
  return client;
}

void beginApiRequest(HTTPClient &http, const String &url) {
  // v2: no reutilizar socket/estado entre peticiones (evita cuelgues por
  // keep-alive con el cliente TLS estático compartido).
  http.setReuse(false);
  http.begin(apiTlsClient(), url);
}

// v2.1: detecta respuestas que NO son JSON. Un 200 con HTML significa que hay
// un gate/proxy/página de login delante de la API (p. ej. panel-gate): el HTTP
// es 200 pero el cuerpo no es la API, así que NO debe darse por bueno.
bool isJsonResponse(const String &body) {
  int i = 0;
  while (i < (int)body.length() &&
         (body[i] == ' ' || body[i] == '\t' || body[i] == '\r' || body[i] == '\n')) {
    i++;
  }
  return i < (int)body.length() && body[i] == '{';
}

