josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto-lowpower.ino
void relayPulse() {
  Serial.println("[RELAY] → ON (abriendo pestillo)");
  relayOn();
  relayOffAt = millis() + OPEN_DURATION_MS;
  relayPulsing = true;
  // Fase 1: relayOff() se ejecuta de forma no bloqueante en loop()
}

// F33: Test seguro de cerradura — pulso de 5ms en relay (no activa solenoide)
// Verifica integridad del circuito: GPIO → transistor → relé → bobina
// El solenoide necesita ≥50ms para moverse; 5ms es imperceptible
bool checkLock() {
#if RELAY_ACTIVE_LOW
  pinMode(RELAY_PIN, OUTPUT);
  digitalWrite(RELAY_PIN, LOW);          // activa relay (active-low)
  delayMicroseconds(LOCK_CHECK_US);      // 5ms = 5000µs
  pinMode(RELAY_PIN, INPUT);             // vuelve a reposo (FLOAT)
#else
  pinMode(RELAY_PIN, OUTPUT);
  digitalWrite(RELAY_PIN, HIGH);         // activa relay (active-high)
  delayMicroseconds(LOCK_CHECK_US);      // 5ms = 5000µs
  digitalWrite(RELAY_PIN, LOW);          // desactiva relay
#endif
  Serial.printf("[LOCK-CHECK] pulso %dµs en GPIO%d — OK\n", LOCK_CHECK_US, RELAY_PIN);
  return true;  // si llegamos aquí, el circuito responde
}

// ── Conectar WiFi leyendo credenciales de NVS ──────────────────────────────
// Devuelve true si conectó, false si hay que pasar a WiFiManager.
bool connectWithNvs() {
  Preferences prefs;
  prefs.begin("cerraduras", true);  // read-only
  String ssid = prefs.getString("ssid", "");
  String pass = prefs.getString("pass", "");
  prefs.end();

  if (ssid.length() == 0) {
    Serial.println("[WIFI] NVS vacío — se necesita provisioning.");
    return false;
  }

  Serial.printf("[WIFI] Conectando con NVS → SSID=%s...\n", ssid.c_str());
  WiFi.mode(WIFI_STA);
  configureRadio();   // LOW-POWER: TX reducido antes de asociar
  WiFi.begin(ssid.c_str(), pass.c_str());

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) { // ~15s timeout
    delay(500);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    wifiConnectedFeedback();
    return true;
  }

  Serial.println("\n[WIFI] Falló conexión con NVS.");
  return false;
}

bool hasStoredWifi() {
  Preferences prefs;
  prefs.begin("cerraduras", true);
  bool present = prefs.getString("ssid", "").length() > 0;
  prefs.end();
  return present;
}

// ── WiFiManager provisioning ────────────────────────────────────────────────
void startWiFiManager() {
  String apSsid = "Cerraduras-Setup-" + chipId();
  Serial.printf("\n[WiFiManager] Iniciando AP: %s\n", apSsid.c_str());
  Serial.println("[WiFiManager] Conectate a esta red con un movil y configura el WiFi.");

  WiFiManager wm;
  wm.setConfigPortalTimeout(300); // 5 minutos de timeout
  configureRadio();  // LOW-POWER: también baja la potencia en modo AP
  // autoConnect: si no hay credenciales guardadas, inicia AP
  // Si hay credenciales guardadas pero fallaron, las usa y reinicia automáticamente.
  bool connected = wm.autoConnect(apSsid.c_str());

  if (!connected) {
    Serial.println("[WiFiManager] Timeout. Reiniciando...");
    delay(1000);
    ESP.restart();
  }

  wifiConnectedFeedback();

  // Guardar credenciales en NVS desde WiFiManager
  Preferences prefs;
  prefs.begin("cerraduras", false);
  prefs.putString("ssid", WiFi.SSID());
  prefs.putString("pass", WiFi.psk());
  prefs.end();
  Serial.printf("[WiFiManager] NVS guardado: SSID=%s\n", WiFi.SSID().c_str());
}

// ── ensureWiFi: garantiza conexión WiFi usando NVS ──────────────────────────
bool ensureWiFi() {
  if (WiFi.status() == WL_CONNECTED) return true;

  Preferences prefs;
  prefs.begin("cerraduras", true);
  String ssid = prefs.getString("ssid", "");
  String pass = prefs.getString("pass", "");
  prefs.end();

  if (ssid.length() == 0) return false;  // sin credenciales

  WiFi.disconnect();
  delay(500);
  WiFi.mode(WIFI_STA);
  configureRadio();   // LOW-POWER: TX reducido también en reconexión
  WiFi.begin(ssid.c_str(), pass.c_str());
  for (int i = 0; i < 20 && WiFi.status() != WL_CONNECTED; i++) delay(500);
  return WiFi.status() == WL_CONNECTED;
}

// ── Sincronizar reloj vía NTP (OBLIGATORIO para TLS) ─────────────────────
// WiFiClientSecure valida la ventana de validez del certificado contra el
// reloj local. Sin hora (1970) mbedTLS rechaza el cert como "not yet valid"
// y TODAS las llamadas HTTPS fallan (health, heartbeat, announce,
// qr/validate, command-result). Se sincroniza una vez tras conectar WiFi.
void syncSystemTime() {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[TIME] Sin WiFi — no se puede sincronizar la hora");
    return;
  }
  configTime(0, 0, "pool.ntp.org", "time.google.com", "time.nist.gov");
  Serial.print("[TIME] Sincronizando hora vía NTP");
  time_t now = time(nullptr);
  int tries = 0;
  while (now < 1700000000 && tries < 20) {   // umbral > Nov 2023; hasta ~20s
    delay(1000);
    now = time(nullptr);
    tries++;
    Serial.print(".");
  }
  Serial.println();
  if (now < 1700000000) {
    Serial.println("[TIME] ⚠ NTP no respondió — el TLS HTTPS fallará (reloj incorrecto)");
  } else {
    struct tm tmi;
    gmtime_r(&now, &tmi);
    Serial.printf("[TIME] OK: %04d-%02d-%02d %02d:%02d:%02d UTC\n",
                  1900 + tmi.tm_year, tmi.tm_mon + 1, tmi.tm_mday,
                  tmi.tm_hour, tmi.tm_min, tmi.tm_sec);
  }
}

// ── Identify: notificar estado del botón a la API ─────────────────────────
void sendIdentify(bool state) {
  if (!ensureWiFi()) {
    Serial.println("[IDENTIFY] Sin WiFi — no se puede enviar");
    return;
  }
  String id   = chipId();
  String body;
  body.reserve(200);  // Fase 1: pre-allocate to prevent heap fragmentation
  body = "{\"external_id\":\"" + id + "\",\"state\":" + (state ? "true" : "false") + "}";
  HTTPClient http;
  beginApiRequest(http, String(API_BASE_URL) + "/api/v1/devices/identify");
  http.addHeader("Content-Type", "application/json");
  addDeviceAuth(http);
  http.setTimeout(1500);
  int code = http.POST(body);
  String resp = http.getString();
  http.end();
  Serial.printf("[IDENTIFY] state=%s → HTTP %d %s\n", state ? "true" : "false", code, resp.c_str());

  if (code == 200) {
    HTTPClient hb;
    beginApiRequest(hb, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
    hb.addHeader("Content-Type", "application/json");
    addDeviceAuth(hb);
    hb.setTimeout(2000);
    hb.POST("{\"external_id\":\"" + id + "\",\"sub_kind\":\"RPI\"}");
    hb.end();
  }
}

// ── setup ─────────────────────────────────────────────────────────────────
void setup() {
  // Relé OFF desde el PRIMER instante del sketch. Antes se hacía tras
  // Serial.begin+delay(3000): en esos ~3 s GPIO16 quedaba sin control y, con la
  // cerradura (solenoide) conectada a la fuente real, podía dispararse en el
  // arranque → brownout → reinicio en bucle sin llegar nunca al AP/heartbeat.
  relayOff();

#if DISABLE_BROWNOUT
  // ÚLTIMO RECURSO (ver DISABLE_BROWNOUT arriba): desactivar el detector de
  // brownout evita el reinicio, pero si la rail realmente cae puede corromper
  // NVS/flash. Solo tiene sentido si 1..5 no bastan.
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
#endif

