josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto-lowpower.ino
  Serial.begin(115200);
  delay(3000);

  // ── LOW-POWER: motivo del arranque + auto-throttle ──
  bootResetReason  = esp_reset_reason();
  bootFromBrownout = (bootResetReason == ESP_RST_BROWNOUT);
  bootFromWdt = (bootResetReason == ESP_RST_TASK_WDT) ||
                (bootResetReason == ESP_RST_INT_WDT)  ||
                (bootResetReason == ESP_RST_WDT)      ||
                (bootResetReason == ESP_RST_PANIC);
  if (bootResetReason == ESP_RST_POWERON) rtcBootCount = 0;  // nuevo power-on
  rtcBootCount++;
#if LOWPOWER_CPU_80MHZ
  setCpuFrequencyMhz(CPU_FREQ_MHZ);  // v2: apagado por defecto (ver define)
#endif

  Serial.println();
  Serial.printf("[BOOT] reset_reason=%s (%d)  boot_count=%lu  CPU=%u MHz%s\n",
                resetReasonName(bootResetReason), (int)bootResetReason,
                (unsigned long)rtcBootCount, (unsigned)getCpuFrequencyMhz(),
                bootFromBrownout ? "  → MODO SEGURO (TX 2 dBm, USB tardío)"
                                 : (bootFromWdt ? "  → cuelgue SW previo" : ""));
  // Diagnóstico sin monitor serie (clave en la fuente): 1 = normal,
  // 2 = cuelgue software (WDT/PANIC), 3 = brownout.
  ledBlinkDiagnostic(ledCodeForResetReason(bootResetReason));

  deviceFactoryKey = loadOrCreateFactoryKey();

  pinMode(IDENTIFY_PIN, INPUT_PULLUP);
  lastIdentifyState = digitalRead(IDENTIFY_PIN);
  if (lastIdentifyState == LOW) {
    Serial.println("[FACTORY-RESET] Botón mantenido durante arranque: esperando liberación...");
    factoryResetProvisioning();
    while (digitalRead(IDENTIFY_PIN) == LOW) delay(20);
    delay(250);
    ESP.restart();
  }

  String id = chipId();
  Serial.println("\n==============================================");
  Serial.println(" ESP32-S3 QR Reader + Relay 12V (v6-12v — ACTIVE-LOW tri-state)");
  Serial.println(" Device ID: " + id);
  Serial.println(" Relay pin: GPIO" + String(RELAY_PIN) + " (ACTIVE-LOW tri-state, SRD-12VDC)");
  Serial.println("==============================================");
  Serial.println("");
  Serial.println("  🔧 PRIMER INICIO: si no hay WiFi guardada,");
  Serial.println("     este dispositivo creara la red:");
  Serial.println("     >> Cerraduras-Setup-" + id + " <<");
  Serial.println("");
  Serial.println("  🏷️  PEGATINA: Cerraduras-Setup-" + id);
  Serial.println("");

  scanned.reserve(512);
  pendingQr.reserve(512);

  // ── WiFi: wipe NVS si firmware nuevo → NVS → connect → WiFiManager ───
  clearNvsIfNewFirmware();    // si versión != stored → wipe NVS + restart
  WiFi.setAutoReconnect(true);
  WiFi.persistent(false);

  // Fase 1: TWDT con timeout 60s (RF-1.1). loopTask NO se vigila hasta el 1er
  // loop(), por lo que el provisioning largo en setup() (WiFiManager, hasta 5 min)
  // ya es seguro sin pausar ni borrar la suscripción. No usar
  // esp_task_wdt_delete(NULL): loopTask aún no está suscrito aquí y generaría un
  // `task_wdt: delete_entry: task not found` benigno en cada arranque.
  //
  // API del watchdog según core: Arduino-ESP32 core 3.x (IDF 5.x) cambió la firma
  // de esp_task_wdt_init() a un config-struct. Guard para mantener compilable el
  // sketch también en core 2.x (IDF 4.x), donde la firma era (timeout_sec, panic).
  //
  // v2: en core 3.x el TWDT ya viene inicializado por el core, así que
  // esp_task_wdt_init() devuelve ESP_ERR_INVALID_STATE ("already initialized") y
  // el timeout de 60 s NUNCA se aplicaba. Si falla, se usa esp_task_wdt_reconfigure
  // para fijar de verdad el timeout y evitar reinicios por stalls transitorios.
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdt_cfg = {
      .timeout_ms     = 60000,   // RF-1.1: 60s
      .idle_core_mask = 0,       // no vigilar idle tasks
      .trigger_panic  = true,    // panic/reinicio al expirar
  };
  esp_err_t wdtErr = esp_task_wdt_init(&wdt_cfg);
  if (wdtErr != ESP_OK) {
    esp_task_wdt_reconfigure(&wdt_cfg);  // ya inicializado: reconfigurar
  }
#else
  esp_task_wdt_init(60, true);   // Arduino core 2.x (IDF 4.x)
#endif

  // ── LOW-POWER: asentamiento de la rail SIN radio antes de encender WiFi ──
  // Deja que los condensadores de entrada se carguen y evita que el pico de
  // asociación WiFi coincida con el inrush de arranque.
  Serial.printf("[BOOT] Asentando alimentación %d ms (radio apagada)...\n", BOOT_SETTLE_MS);
  delay(BOOT_SETTLE_MS);

  bool nvsConnected = connectWithNvs();

  // Provisioning robusto: si no se pudo conectar a la red guardada (o no hay
  // credenciales), SIEMPRE abrimos el portal. La placa nunca debe quedarse en
  // un estado invisible ("credenciales que no conectan → sin AP y sin red").
  // Con timeout de 5 min el portal reinicia y reintenta la red guardada; si
  // vuelve a fallar, portal de nuevo → siempre recuperable desde el AP.
  if (!nvsConnected) {
    startWiFiManager();
  }

  // ── USB Host callbacks ──────────────────────────────────────────────
  usb.setKeyboardLayout(ESP_USB_HOST_KEYBOARD_LAYOUT_EN_US);

  usb.onDeviceConnected([](const EspUsbHostDeviceInfo &device) {
    Serial.print("\n══════════════════════════════════════════\n");
    Serial.print("[USB] DISPOSITIVO CONECTADO:\n");
    espUsbHostPrint(device);
    Serial.print("[USB] Listo. Escanea un QR...\n");
    Serial.print("══════════════════════════════════════════\n\n");
    scannerConnected = true;   // F33: track USB HID scanner presence
    scannerBeatPending = true; // F33: el heartbeat lo envía loop() (no la tarea USB)
  });

  usb.onDeviceDisconnected([](const EspUsbHostDeviceInfo &device) {
    Serial.print("\n[USB] desconectado: ");
    espUsbHostPrint(device);
    scannerConnected = false;  // F33: USB scanner disconnected
  });

  usb.onKeyboard([](const EspUsbHostKeyboardEvent &event) {
    if (!event.pressed) return;
    if (event.ascii == '\r' || event.ascii == '\n') {
      if (scanned.length() > 0) {
        // ── v5-dbg: diagnóstico completo ANTES de filtrar ──────────
        // Trim whitespace que el scanner GM65 pueda añadir (CR, LF, espacios)
        scanned.trim();

